[
    {
        "name": "Unfinished Business",
        "description": "The ghost must conclude any unfinished business they had during their lifetime. This could be anything from resolving a quarrel to delivering a message.",
        "code": "UB001"
    },
    {
        "name": "Acceptance",
        "description": "The ghost must come to terms with its death and accept it. Denial or fear can keep the spirit tied to the earthly realm.",
        "code": "AC002"
    },
    {
        "name": "Forgiveness",
        "description": "If the ghost died with feelings of resentment or anger, they may need to forgive those who wronged them to move on.",
        "code": "FG003"
    },
    {
        "name": "Justice",
        "description": "In cases where the ghost was murdered or wronged in some way, they might need to see justice served before they can move on.",
        "code": "JC004"
    },
    {
        "name": "Loved Ones",
        "description": "If a ghost is clinging to the world due to concern for loved ones, they might need to ensure their loved ones are safe and happy before moving on.",
        "code": "LO005"
    },
    {
        "name": "Knowledge of Death",
        "description": "Some spirits may not even realize they're dead. The realization and acceptance of their death might be necessary for them to move on.",
        "code": "KD006"
    },
    {
        "name": "Release of Guilt",
        "description": "If the ghost died with feelings of guilt, they might need to come to terms with their actions and forgive themselves.",
        "code": "RG007"
    },
    {
        "name": "Fear of the Unknown",
        "description": "Ghosts might fear what comes after death and cling to the familiar world. Overcoming this fear can allow them to move on.",
        "code": "FU008"
    },
    {
        "name": "Rituals",
        "description": "Some cultures believe certain rituals need to be performed for a ghost to move on, such as a proper burial or specific prayers.",
        "code": "RT009"
    },
    {
        "name": "Emotional Release",
        "description": "A ghost might be holding onto strong emotions like love, anger, or sadness. Letting go of these emotions can allow the ghost to move on.",
        "code": "ER010"
    },
    {
        "name": "Presence of Loved Ones",
        "description": "Sometimes, the presence or voice of a loved one can help a ghost move on.",
        "code": "PL011"
    },
    {
        "name": "Revelation of Truth",
        "description": "If a ghost's death was shrouded in mystery or lies, uncovering the truth might be necessary for them to move on.",
        "code": "RT012"
    },
    {
        "name": "Understanding",
        "description": "The ghost might need to understand why they died, especially if their death was sudden or unexpected.",
        "code": "UN013"
    },
    {
        "name": "Peaceful Environment",
        "description": "A quiet, peaceful environment might be necessary for a ghost to gather their thoughts and move on.",
        "code": "PE014"
    },
    {
        "name": "Physical Object",
        "description": "Sometimes a ghost might be tied to a physical object. Destroying or moving that object could allow the ghost to move on.",
        "code": "PO015"
    }
]