[
    {
        "name": "Resolution of Unfinished Business",
        "description": "Ghosts may need to resolve some issue or unfinished business from their life before they can move on.",
        "code": "ROUB"
    },
    {
        "name": "Acceptance of Death",
        "description": "Some ghosts may not even realize they are dead and may need to come to terms with their own death.",
        "code": "AOD"
    },
    {
        "name": "Revenge or Justice",
        "description": "In some stories, a ghost may need to see justice served or revenge taken before they can rest.",
        "code": "ROJ"
    },
    {
        "name": "Proper Burial",
        "description": "In many cultures, ghosts cannot move on until they receive a proper burial or funeral rites.",
        "code": "PB"
    },
    {
        "name": "Reconciliation",
        "description": "The ghost may need to reconcile with someone they wronged in life or someone who wronged them.",
        "code": "REC"
    },
    {
        "name": "Retrieval of Lost Items",
        "description": "Sometimes, ghosts are tied to this realm due to lost or stolen items that they valued greatly.",
        "code": "ROLI"
    },
    {
        "name": "Release of Guilt",
        "description": "Some ghosts carry intense guilt from actions they took during their life. This guilt may need to be absolved before they can move on.",
        "code": "ROG"
    },
    {
        "name": "Uncovering Truth",
        "description": "Ghosts who died under mysterious circumstances may need the truth of their death revealed.",
        "code": "UT"
    },
    {
        "name": "Protection",
        "description": "If a ghost stayed to protect a loved one, they may need assurance that their loved one will be safe without them.",
        "code": "PROT"
    },
    {
        "name": "Exorcism",
        "description": "In some traditions, a ghost needs to be forcefully sent to the next realm by an exorcism.",
        "code": "EXO"
    },
    {
        "name": "Ceremony",
        "description": "Certain cultures believe a ritual or ceremony can help a ghost move on.",
        "code": "CER"
    },
    {
        "name": "Forgiveness",
        "description": "Sometimes a ghost needs to forgive or be forgiven to move on.",
        "code": "FORG"
    },
    {
        "name": "Love",
        "description": "In some tales, the power of love can help a ghost transition to the other side.",
        "code": "LOV"
    },
    {
        "name": "Passage of Time",
        "description": "Some ghosts simply need to wait for a certain amount of time before they can move on.",
        "code": "POT"
    },
    {
        "name": "Fulfillment of a Promise",
        "description": "Some ghosts may have made a promise in their life that they need to fulfill before they can rest.",
        "code": "FOP"
    }
]